# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 2048] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 2048] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-b1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-b2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-b3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, FMF, [256, [1, 3, 5, 7], 0.2, 0.5]]
  - [-1, 1, Conv, [512, 3, 2]] # 6-b4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, FMF, [512, [1, 3, 5, 7], 0.2, 0.5]]
  - [-1, 1, Conv, [1024, 3, 2]] # 9-b5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 11

# YOLOv8.0n head
head:
#Gather-and-Distribute Mechanism
  - [[-1, 8, 5, 2], 1, LowFAM, []] #12
  - [-1, 3, LowIFM, [512, 1]]
  - [-1, 1, FMF, [768, [1, 3, 5, 7], 0.2, 1]] # 14 -> p4, p3

  - [[11, 8, 5], 1, LowLAF, [512]]
  - [14, 1, nn.Conv2d, [512, 1]]
  - [[-2, -1], 3, Inject, [512, -1]] # 17 p4

  - [[8, 5, 2], 1, LowLAF, [256]]
  - [14, 1, nn.Conv2d, [256, 1]]
  - [[-2, -1], 3, Inject, [256, -1, 'bilinear']] # 20 p3(n3)

  - [[11, 17, 20], 1, HighFAM, []]
  - [-1, 3, ConvHighIFM, [1024, 1]]
  - [-1, 1, FMF, [1536, [1, 3, 5, 7], 0.2, 1]] # 23 -> N5, N4

  - [[11, 17], 1, HiLAF, [1024]]
  - [23, 1, Conv, [1024, 1]]
  - [[-1, -2], 1, DFF, []]
  - [-1, 3, RepVGGDW, []] 
  - [-1, 1, MCA, []] # 28 n5

  - [[17, 20], 1, HiLAF, [512]]
  - [23, 1, nn.Upsample, [None, 2, "bilinear"]]
  - [-1, 1, Conv, [512, 1]]
  - [[-1, -3], 1, DFF, []]
  - [-1, 3, RepVGGDW, []] 
  - [-1, 1, MCA, []] # 34 n4

  - [[20, 34, 28], 1, Detect, [nc]] # Detect(n3, n4, n5)
